Tekla Open API Reference for Tekla Structures 2025
BoltItemEnumerator.Current Property
 Returns a bolt item instance of the current element.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BoltItem Current { get; }
Public ReadOnly Property Current As BoltItem
	Get
Property Value
Type: BoltItem
See Also
Reference
BoltItemEnumerator Class
Tekla.Structures.Catalogs Namespace